# Einführung zu Pandas
Pandas baut auf Numpy auf

Installation:
!pip install pandas

In [1]:
# Bibliotheken 
import numpy as np
import pandas as pd

## Serien
~ ähnlich einer Numpy Array = Nmpy Array kann keien Achsenbeschriftung haben => Mit Pandas kann man mit Labels arbeiten

Der erste Hauptdatentyp den wir uns für Pandas anschauen ist der der Series. Lass uns Pandas importieren und einige Series Objekte untersuchen.

Eine Series (dt. Serie) ist sehr ähnlich zu einem NumPy Array. Tatsächlich ist es auf dem NumPy Array Objekt aufgebaut. Was das NumPy Array letztlich von einer Series unterscheidet ist, dass Series Achsenbeschriftungen haben kann. Das bedeutet wir können nicht nur über numerische Indizes, sondern auch über das Label indexieren. Außerdem muss eine Series nicht unbedingt numerische Werte beinhalten.

Schauen wir uns das Konzept an einigen Beispielen an:

### Erstellen einer Pandas Serie

In [2]:
# Basis liste für Pandas
labels = ["a","b","c"]
meine_liste = [10,20,30]
# numpy Array
arr = np.array([10,20,30]) #<= hieraus erstellen wir ein Pandas DF
d = {"a":10,"b":20,"c":30} #<= hieraus erstellen wir ein Pandas DF

#### Aus einer pythonListe

In [3]:
pd.Series(data=meine_liste)
pd.Series(data=meine_liste,index=labels) #<= erstellt labels

a    10
b    20
c    30
dtype: int64

#### Aus einer numpy-Array

In [4]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

#### Aus einem Dictionary

In [5]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Inhalte von einem Pandas series
kann numerisch und strings oder auch eine Funktion sein

#### Inhalt String

In [6]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

#### Inhalt Funktionen

In [7]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

### Indexe Nutzen innerhalb von Pandas-Series
Der Schlüssel zur Nutzung von Series ist das Verständnis für deren Index. Pandas nutzt diese Indexnamen oder -nummern, um schnelle Suchen durchzuführen. Dies funktioniert ähnlich einer Hash-Tabelle oder einem Dictionary.

#### Create Series mit Index

In [8]:
# Serie1
ser1 = pd.Series([1,2,3,4],index=["USA","Deutschland","Russland","Japan"])
ser1

USA            1
Deutschland    2
Russland       3
Japan          4
dtype: int64

In [9]:
# Serie2, hier sind schon bekannte indexe drin, 1,2,&4 // dafür ist russland raus, aber Italien rein
ser2 = pd.Series([1,2,5,4],index=["USA","Deutschland","Italien","Japan"])
ser2

USA            1
Deutschland    2
Italien        5
Japan          4
dtype: int64

#### Abfragen des Series anhand des Index

In [10]:
ser1['Russland'] #<= returnt den wert, indiesem fall etwas numerisches

3

In [11]:
#### Addition von Series

In [12]:
ser1 + ser2 # D = 2+2 usw // italien i ist nur einmal drin => nan

Deutschland    4.0
Italien        NaN
Japan          8.0
Russland       NaN
USA            2.0
dtype: float64

## Data-Frame 
Data Frames sind das Steckenpferd von Pandas und wurden direkt durch die Programmiersprache R inspiriert. Wir können uns Data Frames als eine Vielzahl von Series vorstellen, die zusammengefügt wurden, um sich den selben Index zu teilen.

In [13]:
from numpy.random import randn
np.random.seed(101)

### Erstellen eines Dataframes

#### aus random

In [14]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())# <0 hier wird mit dem Split gearbeitet
names='W X Y Z'.split()
index='A B C D E'.split()
print(names, index)
print(df)
df['W']

['W', 'X', 'Y', 'Z'] ['A', 'B', 'C', 'D', 'E']
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [15]:
names='W X Y Z'.split()
index='A B C D E'.split()

### Spalten Auswahl und Indexierung

In [34]:
# Einzelne Spalte auswählen
df["W"] #<= die einzelne Spalte ist eine Seris

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [35]:
# Eine Liste von Spaltennamen übergeben
df[["W","Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

### Spalte hinzufügen

#### Aus einer Rechnung der internen Series/Spalten

In [30]:
df["neu"] = df["W"] + df["Y"]
df

          W         X         Y         Z       neu
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

#### einfache Konstante

### Spalten entfernen

In [32]:
df.drop('neu', axis=1) # <= zeigt das nur, das muss noch zugewiesen werden
print(df)
df = df.drop('neu', axis=1)# <= ist das gleiche wie df.drop('neu',axis=1,inplace=True)
df

          W         X         Y         Z       neu
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df

          W         X         Y         Z       neu
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

### Zeilen entfernen

In [33]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

### Zeilen Auswahl und Indexierung

#### Mehtode mit Loc

In [39]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

#### Mehtode mit iLoc indexLoc

In [45]:
df.iloc[0] # <= index loc

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

### Subsets von Dataframe

#### Einzelner wert via LOC

In [47]:
# Zeile & Spalten Sprich values
df.loc['B','Y']

-0.8480769834036315

#### SubFrame via LOC

In [48]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

#### Bedingte Auswahl

In [49]:
df > 0 #<= hier wird für jeden Wert eine Bedingung geprüft und entsprechend ausgegeben

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [53]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
df[df['W']>0]['Y'] #<= bedingung und dann nur eine Bestimme Spalte || Spalte C fehlt da w da NAN

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [55]:
df[(df['W']>0) & (df['Y'] > 1)] 
# zwei Bedingungen => hier die logischen Operatoren von Python checken...das ist nicht and oder OR sondern & oder |

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

### Indexierung extended / Mehr Index

#### Index zurücksetzten in den Numerischen Wert
hier werden die Alten indexe in eine Spalte übernommen

In [59]:
df.reset_index() # fehlt die Zuweisung

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

#### zuweisen neuen Index

In [70]:
neuind = 'BY BW HH BB NW'.split()
df["Staaten"] = neuind
print(df)
df= df.set_index('Staaten')
df

                W         X         Y         Z
Staaten
BY       2.706850  0.628133  0.907969  0.503826
BW       0.651118 -0.319318 -0.848077  0.605965
HH      -2.018168  0.740122  0.528813 -0.589001
BB       0.188695 -0.758872 -0.933237  0.955057
NW       0.190794  1.978757  2.605967  0.683509

### Multi-Index und Index Hierarchie
hier wird ein Aussen und ein Innen Index verwendet

#### Erstelle Multi-Index

In [108]:
aussen = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
innen = [1,2,3,1,2,3]
hier_index = list(zip(aussen,innen)) # hier = heirarchich
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [109]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -1.005187 -0.741790
   2  0.187125 -0.732845
   3 -1.382920  1.482495
G2 1  0.961458 -2.141212
   2  0.992573  1.192241
   3 -1.046780  1.292765

In [110]:
#Diesen Multiindex kann man jetzt nach bestimmtne Kriterien Downfiltern
df.loc['G1'] #<= nur nach g1 gefiltert
#df.loc[2] #<= nur nach g1 gefiltert
df.loc['G1'].loc[2] #<= nur nach g1 gefiltert & g2 gefiltert

A    0.187125
B   -0.732845
Name: 2, dtype: float64

#### Weise Namen an Multiindex zu

In [111]:
df.index.names

FrozenList([None, None])

In [113]:
df.index.names = ['Gruppe','Num']
df

                   A         B
Gruppe Num
G1     1   -1.005187 -0.741790
       2    0.187125 -0.732845
       3   -1.382920  1.482495
G2     1    0.961458 -2.141212
       2    0.992573  1.192241
       3   -1.046780  1.292765

#### Abfragen von Multiindex

In [118]:
# Filtern nach dem ersten Index
df.xs('G1') # <= ähnlich wie

            A         B
Num
1   -1.005187 -0.741790
2    0.187125 -0.732845
3   -1.382920  1.482495

In [119]:
# Filtern nach dem zweiten Index
df.xs(1,level='Num')

               A         B
Gruppe
G1     -1.005187 -0.741790
G2      0.961458 -2.141212

In [120]:
df.xs(['G1',1])

A   -1.005187
B   -0.741790
Name: (G1, 1), dtype: float64

## Fehlende Daten/Missing Data
Dieses Problem der fehlenden Daten tritt relativ häufig auf:

unvollständige Datensätze aufgrund technischer Pannen oder eines Datenverlustes
wenn einige befragte Personen aufgrund mangelnden Wissens oder unzureichender Antwortmotivation auf bestimmte Fragen bewusst keine Antwort geben
Nun werden wir einige der üblichen Wege (z.B. Eliminierungsverfahren und Imputation) kennenlernen, um mit Missing Data (dt. fehlenden Daten) umzugehen.

In [122]:
# BasicData
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### Eliminierung
Hat einen Großen Informationsverlust.

Das Eliminierungsverfahren (auch: Complete-case analysis) zählt zu den gängigen Missing-Data-Techniken. Dabei werden sämtliche Datensätze, bei denen eines oder mehrere Erhebungsmerkmale fehlende Werte aufweisen, aus der Datenmatrix gestrichen. Dieses Verfahren ist zwar sehr einfach, hat aber erhebliche Nachteile: 
1. Insbesondere hat es einen erheblichen Informationsverlust zur Folge.
1. Ferner kann diese Technik zu einer Verfälschung der verbleibenden Stichprobe führen. Als häufiges Beispiel gelten Umfragen bezüglich des Einkommens, bei denen es durchaus vorkommen kann, dass gerade Personen mit einem relativ hohen Einkommen dieses ungerne angeben und es daher in solchen Fällen tendenziell zu Missing Data kommt.

In [123]:
df.dropna()# <= nur noch die Zeilen die kein Nullwerte haben

     A    B  C
0  1.0  5.0  1

In [124]:
df.dropna(axis=1) #<= nur noch die Spaltend die keine Nullwerte haben

   C
0  1
1  2
2  3

In [125]:
df.dropna(thresh=2) #<= threshold ab einer gewissen Anzahl von leeren werten

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

### Imputation
Kann Verfälschungen haben

Um dieses Problem der Eliminierungsverfahren möglichst in den Griff zu bekommen, wurden Imputationsverfahren entwickelt, bei denen versucht wird, fehlende Daten nicht einfach zu ignorieren, sondern stattdessen durch plausible Werte zu ersetzen, die unter anderem mit Hilfe der beobachteten Werte des gleichen Datensatzes geschätzt werden können.

In [ ]:
# finde die Nullvalues
df.isnull()

#### Konstante

In [130]:
df.fillna(value='Füllwert') #<= Konstatnte
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

#### Mean

In [131]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Gruppieren / GroupBy
Die `groupby` Methode (dt. gruppieren nach) erlaubt es uns Zeilen zu gruppieren und Aggregationsfunktionen aufzurufen.
![bild](./imgs/Groupby.PNG)

In [134]:
# Data Frame erstellen
data = {'Firma':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Firma   Person  Sales
0  GOOG      Sam    200
1  GOOG  Charlie    120
2  MSFT      Amy    340
3  MSFT  Vanessa    124
4    FB     Carl    243
5    FB    Sarah    350

### Simple Gruppieren

In [142]:
# Groupby Firma
df.groupby('Firma') #<0 kann noch nicht wirklich genutzt werden, aber hier kann die aggreaftion ausgewählt werdne
df.groupby('Firma').mean()

       Sales
Firma
FB     296.5
GOOG   160.0
MSFT   232.0

In [137]:
## Mit variablen
nach_firma = df.groupby('Firma')
nach_firma.mean()

       Sales
Firma
FB     296.5
GOOG   160.0
MSFT   232.0

### Gruppieren mit Mathematischen Funktionen

In [143]:
### Funktionen
# Standardabweichung
nach_firma.std()
# min
nach_firma.min()
# max
nach_firma.max()
# absolut
nach_firma.count()
# Zusammenfassung
nach_firma.describe()

      Sales
      count   mean         std    min     25%    50%     75%    max
Firma
FB      2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT    2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

hier noch die Darstellung Transponiert

In [141]:
nach_firma.describe().transpose()

Firma                FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

## Zusammenfügen und Verknüpfen || Merge, Join & Concatenation
Es gibt im Wesentlichen drei Wege, um Data Frames zusammenzuführen: Merging, Joining und Concatenating (Verknüpfen). In dieser Lektion werden wir diese drei Methoden anhand von Beispielen durchgehen.

In [147]:
### Data für die Demonstration
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
print(df1)
print('###########')
print(df2)
print('###########')
print(df3)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
###########
    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
###########
      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Concat
*Concatenating* bezeichnet das aneinanderreihen von Data Frames. Dabei sollte man beachten, dass die Dimensionen entlang der Achse, entlang derer man anreiht, übereinstimmen.

Dann kann man `pd.concat` nutzen und eine Liste von Data Frames übergeben:

#### Zeilen aneinander reihen

In [149]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#### Spalten zusammenführen

In [151]:
pd.concat([df1,df2,df3],axis=1) #<= gibt so keinen Sinn, concat gibt mehr sinn bei Zeilen zusammenhängen

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merge

Vergleiche SQL-Abfragen in dem Kontext

#### inner Join

##### InnerJoin mit einem Key

In [167]:
# BSP data für Merge
links = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
rechts = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})    
print(links)  
print('###########')
print(rechts)

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
###########
  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [168]:
pd.merge(links,rechts,how='inner',on='key') #<= hier inner /leftouter

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

##### Inner Join mit zwei Keys

In [169]:
links = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
rechts = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

print(links)  
print('###########')
print(rechts) #

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3
###########
  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [170]:
pd.merge(links, rechts, on=['key1', 'key2']) # <= hier wird mit zwei key gejoint

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

#### Outer Join

In [171]:
# mit zwei Keys
pd.merge(links, rechts, how="outer", on=['key1', 'key2']) # <= empties werden mit NAN aufgeüllte

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

#### Right Join

In [172]:
pd.merge(links, rechts, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

#### Left Join

In [166]:
pd.merge(links, rechts, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

### Join
*Joining* ist eine übliche Methode, um Spalten mit zwei potentiell unterschiedlichen indizierten Data Frames in einen gemeinsamen Data Frame zu packen.

In [174]:
links = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

rechts = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])


print(links)  
print('###########')
print(rechts) #

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
###########
     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

#### Inner Join

In [176]:
# Wir fügen an das linke DF das Rechte an
links.join(rechts)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

#### Outer Join

In [177]:
links.join(rechts, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Operationen

In [178]:
df = pd.DataFrame({'spa1':[1,2,3,4],'spa2':[444,555,666,444],'spa3':['abc','def','ghi','xyz']})
df.head()

   spa1  spa2 spa3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### head
nur die ersten x Zeilen Ausgeben

In [179]:
df = pd.DataFrame({'spa1':[1,2,3,4],'spa2':[444,555,666,444],'spa3':['abc','def','ghi','xyz']})
df.head()

   spa1  spa2 spa3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### unique value
gebe jede Ausprägung nur einmal aus

In [180]:
df['spa2'].unique()

array([444, 555, 666], dtype=int64)

In [181]:
# number de runiquen value
df['spa2'].nunique()

3

### Count 
gibt die Anzahl der uniquen Werte zurück <= nichts anders als Groupby & Aggregation

In [183]:
df['spa2'].value_counts()

444    2
555    1
666    1
Name: spa2, dtype: int64

### Apply

#### eigene Funktion

In [185]:

def mal2(x):
    return x*2
df['spa1'].apply(mal2)

0    2
1    4
2    6
3    8
Name: spa1, dtype: int64

#### Builtin Function

In [186]:
df['spa3'].apply(len)

0    3
1    3
2    3
3    3
Name: spa3, dtype: int64

#### Lambda Function

In [188]:
df['spa2'].apply(lambda x: x+2)

0    446
1    557
2    668
3    446
Name: spa2, dtype: int64

### Aggreagationen

In [195]:
df['spa1'].sum()

10

In [196]:
df['spa1'].max()

4

In [197]:
df['spa1'].min()

1

In [198]:
df['spa1'].var()

1.6666666666666667

In [199]:
df['spa1'].std()

1.2909944487358056

### SpaltenZeilen name zurückgegebn name, Column name

In [201]:
df.columns

Index(['spa1', 'spa2', 'spa3'], dtype='object')

In [202]:
df.index

RangeIndex(start=0, stop=4, step=1)

### Sortieren

In [203]:
df.sort_values(by='spa2') #inplace=False per Standard

   spa1  spa2 spa3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

### Null Werte finden

In [206]:
df.isnull()

    spa1   spa2   spa3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### Pivotieren

In [208]:
# Data for Pivot
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [209]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Daten Input und Output

### Csv

In [211]:
# Input
df = pd.read_csv('./data/example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [212]:
# Output
df.to_csv('./data/my_example.csv',index=False)

### Excel
Pandas kann Excel-Dateien lesen und schreiben. Beachtet aber, dass dabei nur Daten importiert werden. Formeln und Bilder sind dabei nicht eingeschlossen. Makros oder Bilder in der Datei zu haben kann die `read_excel` Methode zum Abstürzen bringen.

In [214]:
# Input
#!pip install xlrd 
pd.read_excel('./data/Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [218]:
# Output
# !pip install openpyxl
df.to_excel('./data/Excel_SampleOut.xlsx',sheet_name='Sheet1')

### Html

In [220]:
!pip install lxml
!pip install html5lib
!pip install BeautifulSoup4

Collecting lxml
  Downloading https://files.pythonhosted.org/packages/ab/4e/fd747f8948b107147a0e618a75bdad3a0d1de6227d856261008fd8f850af/lxml-4.5.0-cp36-cp36m-win_amd64.whl (3.7MB)
Installing collected packages: lxml
Successfully installed lxml-4.5.0
Collecting html5lib
  Downloading https://files.pythonhosted.org/packages/a5/62/bbd2be0e7943ec8504b517e62bab011b4946e1258842bc159e5dfde15b96/html5lib-1.0.1-py2.py3-none-any.whl (117kB)
Requirement already satisfied: six>=1.9 in c:\users\1810837475\.conda\envs\kompensationsarbeit\lib\site-packages (from html5lib) (1.13.0)
Requirement already satisfied: webencodings in c:\users\1810837475\.conda\envs\kompensationsarbeit\lib\site-packages (from html5lib) (0.5.1)
Installing collected packages: html5lib
Successfully installed html5lib-1.0.1
Collecting BeautifulSoup4
  Using cached https://files.pythonhosted.org/packages/cb/a1/c698cf319e9cfed6b17376281bd0efc6bfc8465698f54170ef60a485ab5d/beautifulsoup4-4.8.2-py3-none-any.whl
Collecting soupsieve>=1.2
  Downloading https://files.pythonhosted.org/packages/05/cf/ea245e52f55823f19992447b008bcbb7f78efc5960d77f6c34b5b45b36dd/soupsieve-2.0-py2.py3-none-any.whl
Installing collected packages: soupsieve, BeautifulSoup4
Successfully installed BeautifulSoup4-4.8.2 soupsieve-2.0

In [221]:
'''
!pip install lxml
!pip install html5lib
!pip install BeautifulSoup4
'''
df_html = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

ImportError: lxml not found, please install it

### Sql